{
  "personal": {
    "name": "Андрей Волжин",
    "mainJob": "Full Stack разработчик",
    "secondJob": "Backend разработчик",
    "summary": "Я разносторонний и опытный разработчик программного обеспечения с большим опытом работы с несколькими языками программирования и технологиями. Работал с Go/Golang, PHP, JavaScript и ReactJS, и у меня есть успешный опыт создания успешных веб-приложений и сервисов. Я оттачивал свои навыки в различных проектах, включая разработку веб-сайтов, проектирование CRM-систем, интеграцию коммуникаций в реальном времени и разработку чат-ботов. Сосредоточившись на инновациях и решении проблем, я хорошо подготовлен к решению сложных задач в мире разработки программного обеспечения.",
    "skills": [
      {
        "skill": "Языки",
        "description": "Знание Go/Golang, PHP, JavaScript"
      },
      {
        "skill": "Frontend Разработка",
        "description": "Большой опыт создания интерактивных и удобных веб-интерфейсов с использованием ReactJS."
      },
      {
        "skill": "Backend Разработка",
        "description": "Опыт разработки высокопроизводительных серверных систем, включая миграцию сложного CRM-проекта с PHP на GoLang."
      },
      {
        "skill": "Связь в режиме реального времени",
        "description": "Имеет навыки интеграции SIP (протокол инициации сеанса) в веб-приложения с использованием JSSIP, а также глубокие знания сервера Asterisk (FreePBX) для решений VoIP."
      },
      {
        "skill": "Разработка ботов",
        "description": "Знаком с созданием ботов Telegram и Discord, демонстрирую умение автоматизировать процессы и взаимодействовать с внешними API."
      }
    ],
    "languages": [
      {
        "language": "Английский",
        "level": "Продвинутое владение",
        "lng": "en"
      },
      {
        "language": "Русский",
        "level": "Родной язык",
        "lng": "ru"
      },
      {
        "language": "Японский",
        "level": "Элементарное владение",
        "lng": "jp"
      }
    ],
    "experience": [
      {
        "exp": "Веб разработчик",
        "descriptions": [
          "Успешно разработал и запустил множество веб-сайтов, продемонстрировав острый взгляд на дизайн и функциональность.",
          "Сотрудничество с межфункциональными командами для обеспечения плавной интеграции интерфейсных и серверных компонентов.",
          "Руководил миграцией внутренней CRM-системы с PHP на GoLang, что привело к повышению производительности, масштабируемости и удобства обслуживания.",
          "Выступал в качестве помощника по разработке, внося свой вклад в разработку системы на ReactJS для эффективного повторного использования компонентов пользовательского интерфейса."
        ]
      },
      {
        "exp": "Специалист по коммуникациям в реальном времени",
        "descriptions": [
          "Разработаны и реализованы функции связи в реальном времени путем интеграции SIP в веб-приложения с использованием JSSIP, что повышает вовлеченность и интерактивность пользователей.",
          "Использование опыта работы с серверами Asterisk (FreePBX) для создания надежных решений VoIP, что способствовало успеху проекта."
        ]
      },
      {
        "exp": "Разработчик ботов",
        "descriptions": [
          "Создавал и поддерживал ботов Telegram и Discord, автоматизировал задачи и улучшал взаимодействие с пользователем.",
          "Реализованы специальные функции и интеграция с внешними сервисами для удовлетворения требований конкретного проекта."
        ]
      }
    ],
    "achievements": [
      "Активный участник проектов с открытым исходным кодом, связанных с GoLang и ReactJS, демонстрируя приверженность сообществу разработчиков.",
      "Регулярно участвую в технических встречах, конференциях и онлайн-форумах, чтобы быть в курсе последних тенденций и инноваций в разработке программного обеспечения.",
      "Стремление к постоянному обучению и профессиональному росту, страсть к изучению новых технологий."
    ],
    "conclusion": "Как разработчик программного обеспечения с разнообразным набором навыков и опытом успешной реализации проектов, я хорошо подготовлен к выполнению сложных задач в области веб-разработки, общения в реальном времени и разработки ботов. Моя приверженность инновациям, адаптивности и постоянному самосовершенствованию делает меня ценным активом в любой команде или проекте по разработке программного обеспечения.",
    "education": [
      "Южно-уральский государственный университет. Нациаональный исследовательский университет. Факультет Прикладная математика и информатика.",
      "Курсы повышения квалификации по Golang",
      "Курсы повышения квалификации по Asterisk"
    ]
  },
  "application": {
    "languages": "Языки",
    "summary": "Краткое содержание",
    "skills": "Технические навыки",
    "experience": "Профессиональный опыт",
    "achievements": "Дополнительные достижения",
    "conclusion": "Заключение",
    "education": "Образование"
  }
}